/*****************************************************************
 ** 文件名:  ht_main.c
 ** 2020-2022 珠海禾田电子科技有限公司 Co.Ltd
 
 ** 创建人: 骆军城
 ** 日  期: 2022-01
 ** 描  述: HT主函数文件
 ** 版  本: V1.0

 ** 修改人:
 ** 日  期:
 ** 修改描述:
 ** 版  本: 
******************************************************************/

/*****************************************************************
* 包含头文件
******************************************************************/

#include <stdio.h>

#include "hidapi.h"


/*****************************************************************
* 宏定义(仅在当前C文件使用的宏定义写在当前C文件中，否则需写在H文件中)
******************************************************************/
#define HidDevice				"/dev/usb/hiddev0"

/*****************************************************************
* 结构定义(仅在当前C文件使用的结构体写在当前C文件中，否则需写在H文件中)
******************************************************************/

/*****************************************************************
* 全局变量定义
******************************************************************/

/*****************************************************************
* 静态变量定义
******************************************************************/

/*****************************************************************
* 外部变量声明（如果全局变量没有在其它的H文件声明，引用时需在此处声明，
*如果已在其它H文件声明，则只需包含此H文件即可）
******************************************************************/

/*****************************************************************
* 函数原型声明
******************************************************************/

/*****************************************************************
* 函数定义
*注意，编写函数需首先定义所有的局部变量等，不允许在
*函数的中间出现新的变量的定义。
******************************************************************/


/*************************************************
** Function：	htMain_Init
** Description: 禾田初始化函数
** Input:	none
** Output：	none

** Return:	none
** Author：骆军城
** Date：2022-01-25

** Modification History：
** Author：
** Date：
** Description：
*************************************************/

int main(void)
{
	int hidFd = -1;
	int ni = 0;
	int nRet = 0;
	uint8_t sndBuf[64] = {0x8f, 0x01, 0x00, 0x00};
	uint8_t rcvBuf[64] = {0x00, 0x00, 0x00, 0x00};
	
	hidFd =  hidAPI_Open(HidDevice);
	if(hidFd<0)
	{
		printf("hidAPI_Init failed\r\n");
		return -1;
	}

	nRet = hidAPI_Send(hidFd, sndBuf, 4);
	if(nRet<0)
	{
		printf("hidAPI_Send failed\r\n");
		goto iExit;
	}

	while(1)
	{
	
		nRet = hidAPI_Recv(hidFd, rcvBuf,64);
		if(nRet>0)
		{
			for(ni=0;ni<nRet;ni++)
				printf("rcvBuf[%d]= %02x\n", ni, rcvBuf[ni]);
		}
		

		sleep(1);
	}


iExit:
	hidAPI_Close(hidFd);

	return 0;
}

